Dartlead/mems_3d_tracking/startup/startup_stm32f767zi.c
#include "stm32f767zi.h"
#include "FreeRTOSConfig.h"
#include <stdint.h>

/* ============================================================================================================= */
/* External References                                                                                           */
/* ============================================================================================================= */
extern int main(void);

/* ============================================================================================================= */
/* Heap Declaration                                                                                              */
/* ============================================================================================================= */
uint8_t ucHeap[configTOTAL_HEAP_SIZE] __attribute__((section(".heap")));

/* ============================================================================================================= */
/* Memory Region Symbols (Provided by Linker Script)                                                             */
/* ============================================================================================================= */
extern uint32_t __gst_start__;       //!# Start of the global section table
extern uint32_t __gst_end__;         //!# End of the global section table
extern uint32_t __etext;             //!# End of text segment
extern uint32_t __fast_text_start__; //!# Start of the fast_text segment
extern uint32_t __fast_text_end__;   //!# End of the fast_text segment
extern uint32_t __data_start__;      //!# Start of the data segment
extern uint32_t __data_end__;        //!# End of the data segment
extern uint32_t __bss_start__;       //!# Start of the BSS segment
extern uint32_t __bss_end__;         //!# End of the BSS segment
extern uint32_t __heap_base;         //!# Base of the memory region allocated for the heap
extern uint32_t __heap_limit;        //!# Limit of the memory region allocated for the heap
extern uint32_t __stack_limit;       //!# Limit of the stack
extern uint32_t __stack_top;         //!# Top of the stack
extern uint32_t __stack_base;        //!# Base of the stack

/* ============================================================================================================= */
/* Cortex-M7 Processor Exception Handlers                                                                        */
/* ============================================================================================================= */
void Default_Handler           (void);
void Reset_Handler             (void);
void NMI_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void HardFault_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void MemManage_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void BusFault_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void UsageFault_Handler        (void) __attribute__((weak, alias("Default_Handler")));
void SVC_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void DebugMon_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void PendSV_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void SysTick_Handler           (void) __attribute__((weak, alias("Default_Handler")));

/* ============================================================================================================= */
/* External Interrupt Handlers                                                                                   */
/* ============================================================================================================= */
void WWDG_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void PVD_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void TAMP_STAMP_Handler        (void) __attribute__((weak, alias("Default_Handler")));
void RTC_WKUP_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void FLASH_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void RCC_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void EXTI0_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void EXTI1_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void EXTI2_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void EXTI3_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void EXTI4_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream0_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream1_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream2_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream3_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream4_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream5_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream6_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void ADC_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_TX_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_RX0_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_RX1_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN1_SCE_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI9_5_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_BRK_TIM9_Handler     (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_UP_TIM10_Handler     (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_TRG_COM_TIM11_Handler(void) __attribute__((weak, alias("Default_Handler")));
void TIM1_CC_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM2_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void TIM3_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void TIM4_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_EV_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_ER_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_EV_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_ER_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void SPI1_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void SPI2_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void USART1_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void USART2_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void USART3_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void EXTI15_10_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void RTC_Alarm_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void OTG_FS_WKUP_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_BRK_TIM12_Handler    (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_UP_TIM13_Handler     (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_TRG_COM_TIM14_Handler(void) __attribute__((weak, alias("Default_Handler")));
void TIM8_CC_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream7_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void FMC_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC1_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void TIM5_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void SPI3_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void UART4_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void UART5_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void TIM6_DAC_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM7_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream0_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream1_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream2_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream3_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream4_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void ETH_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void ETH_WKUP_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN2_TX_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void CAN2_RX0_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN2_RX1_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN2_SCE_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void OTG_FS_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream5_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream6_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream7_Handler      (void) __attribute__((weak, alias("Default_Handler")));
void USART6_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_EV_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_ER_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void OTG_HS_EP1_OUT_Handler    (void) __attribute__((weak, alias("Default_Handler")));
void OTG_HS_EP1_IN_Handler     (void) __attribute__((weak, alias("Default_Handler")));
void OTG_HS_WKUP_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void OTG_HS_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void DCMI_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void CRYP_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void HASH_RNG_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void FPU_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void UART7_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void UART8_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void SPI4_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void SPI5_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void SPI6_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void SAI1_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void LCD_TFT_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void LCD_TFT_ER_Handler        (void) __attribute__((weak, alias("Default_Handler")));
void DMA2D_Handler             (void) __attribute__((weak, alias("Default_Handler")));
void SAI2_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void QuadSPI_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void LP_Timer1_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void HDMI_CEC_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void I2C4_EV_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C4_ER_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void SPDIFRX_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void DSIHOST_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT0_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT1_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT2_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT3_Handler       (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC2_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void CAN3_TX_Handler           (void) __attribute__((weak, alias("Default_Handler")));
void CAN3_RX0_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN3_RX1_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void CAN3_SCE_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void JPEG_Handler              (void) __attribute__((weak, alias("Default_Handler")));
void MDIOS_Handler             (void) __attribute__((weak, alias("Default_Handler")));

/* ============================================================================================================= */
/* Interrupt Vector Table                                                                                        */
/* ============================================================================================================= */
#if defined (__GNUC__)
	#pragma GCC diagnostic push
	#pragma GCC diagnostic ignored "-Wpedantic"
#endif

__VECTOR_TABLE_ATTRIBUTE void (* const vector_table[])(void) = {
	  (void (*)(void))(&__stack_top)
	
	/* Processor exceptions         Description                                     Priority          Address     */
	, Reset_Handler              /* Reset                                           -3   (fixed)      0x0000 0004 */
	, NMI_Handler                /* Non-maskable interrupt                          -2   (fixed)      0x0000 0008 */
	, HardFault_Handler          /* All class of faults                             -1   (fixed)      0x0000 000C */
	, MemManage_Handler          /* Memory management fault                          0   (settable)   0x0000 0010 */
	, BusFault_Handler           /* Pre-fetch fault, memory access fault             1   (settable)   0x0000 0014 */
	, UsageFault_Handler         /* Undefined instruction or illegal state           2   (settable)   0x0000 0018 */
	, 0                          /* Reserved                                        N/A               0x0000 001C */
	, 0                          /* Reserved                                        N/A               0x0000 0020 */
	, 0                          /* Reserved                                        N/A               0x0000 0024 */
	, 0                          /* Reserved                                        N/A               0x0000 0028 */
	, SVC_Handler                /* System service call via SWI instruction          3   (settable)   0x0000 002C */
	, DebugMon_Handler           /* Debug Monitor                                    4   (settable)   0x0000 0030 */
	, 0                          /* Reserved                                        N/A               0x0000 0034 */
	, PendSV_Handler             /* Pendable request for system service              5   (settable)   0x0000 0038 */
	, SysTick_Handler            /* System tick timer                                6   (settable)   0x0000 003C */

